bench/mysql.log
sysbench 1.0.20 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 3
Report intermediate results every 5 second(s)
Initializing random number generator from current time

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[ 5s ] thds: 3 tps: 1424.16 qps: 41315.92 (r/w/o: 41315.92/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 3 tps: 1394.06 qps: 40425.29 (r/w/o: 40425.29/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 3 tps: 1367.82 qps: 39666.64 (r/w/o: 39666.64/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 3 tps: 1294.77 qps: 37548.19 (r/w/o: 37548.19/0.00/0.00) lat (ms,95%): 3.02 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 3 tps: 1301.35 qps: 37735.64 (r/w/o: 37735.64/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 3 tps: 1283.20 qps: 37213.21 (r/w/o: 37213.21/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 3 tps: 1237.02 qps: 35872.94 (r/w/o: 35872.94/0.00/0.00) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 3 tps: 1207.55 qps: 35016.86 (r/w/o: 35016.86/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 3 tps: 1213.64 qps: 35190.73 (r/w/o: 35190.73/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 3 tps: 1246.67 qps: 36160.12 (r/w/o: 36160.12/0.00/0.00) lat (ms,95%): 3.02 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 3 tps: 1177.32 qps: 34145.75 (r/w/o: 34145.75/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 3 tps: 1179.78 qps: 34210.08 (r/w/o: 34210.08/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 3 tps: 1194.81 qps: 34650.20 (r/w/o: 34650.20/0.00/0.00) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 3 tps: 1190.99 qps: 34531.57 (r/w/o: 34531.57/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 3 tps: 1168.20 qps: 33886.23 (r/w/o: 33886.23/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 3 tps: 1172.00 qps: 33991.71 (r/w/o: 33991.71/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 3 tps: 1146.74 qps: 33250.72 (r/w/o: 33250.72/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 3 tps: 1106.85 qps: 32095.72 (r/w/o: 32095.72/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 3 tps: 1149.31 qps: 33333.93 (r/w/o: 33333.93/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 3 tps: 1166.12 qps: 33812.36 (r/w/o: 33812.36/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 3 tps: 1188.23 qps: 34462.56 (r/w/o: 34462.56/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 3 tps: 1192.35 qps: 34572.40 (r/w/o: 34572.40/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 3 tps: 1217.02 qps: 35297.83 (r/w/o: 35297.83/0.00/0.00) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 3 tps: 1185.58 qps: 34381.79 (r/w/o: 34381.79/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 3 tps: 1188.42 qps: 34468.43 (r/w/o: 34468.43/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 3 tps: 1202.52 qps: 34870.01 (r/w/o: 34870.01/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 3 tps: 1158.37 qps: 33592.67 (r/w/o: 33592.67/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 3 tps: 1151.53 qps: 33393.59 (r/w/o: 33393.59/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 3 tps: 1109.40 qps: 32172.91 (r/w/o: 32172.91/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 3 tps: 1137.96 qps: 32995.77 (r/w/o: 32995.77/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 3 tps: 1105.40 qps: 32059.48 (r/w/o: 32059.48/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 3 tps: 1138.40 qps: 33013.75 (r/w/o: 33013.75/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 3 tps: 1145.84 qps: 33232.85 (r/w/o: 33232.85/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 3 tps: 1184.19 qps: 34342.73 (r/w/o: 34342.73/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 3 tps: 1180.83 qps: 34241.79 (r/w/o: 34241.79/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 3 tps: 1150.13 qps: 33356.65 (r/w/o: 33356.65/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 3 tps: 1187.39 qps: 34432.02 (r/w/o: 34432.02/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 3 tps: 1184.64 qps: 34352.48 (r/w/o: 34352.48/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 3 tps: 1220.44 qps: 35391.16 (r/w/o: 35391.16/0.00/0.00) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 3 tps: 1190.99 qps: 34545.68 (r/w/o: 34545.68/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 3 tps: 1229.76 qps: 35662.34 (r/w/o: 35662.34/0.00/0.00) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 3 tps: 1192.05 qps: 34566.34 (r/w/o: 34566.34/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 3 tps: 1161.56 qps: 33682.21 (r/w/o: 33682.21/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 3 tps: 1152.23 qps: 33412.34 (r/w/o: 33412.34/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 3 tps: 1151.09 qps: 33385.73 (r/w/o: 33385.73/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 3 tps: 1147.58 qps: 33282.50 (r/w/o: 33282.50/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 3 tps: 1140.85 qps: 33084.57 (r/w/o: 33084.57/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 3 tps: 1145.88 qps: 33232.86 (r/w/o: 33232.86/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 3 tps: 1138.93 qps: 33022.16 (r/w/o: 33022.16/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 3 tps: 1181.04 qps: 34254.01 (r/w/o: 34254.01/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 3 tps: 1194.80 qps: 34645.48 (r/w/o: 34645.48/0.00/0.00) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 3 tps: 1130.05 qps: 32776.82 (r/w/o: 32776.82/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 3 tps: 1141.51 qps: 33104.70 (r/w/o: 33104.70/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 3 tps: 1122.65 qps: 32554.04 (r/w/o: 32554.04/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 3 tps: 1101.96 qps: 31962.60 (r/w/o: 31962.60/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 3 tps: 1088.01 qps: 31541.49 (r/w/o: 31541.49/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 3 tps: 1106.97 qps: 32106.11 (r/w/o: 32106.11/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 3 tps: 1100.83 qps: 31931.10 (r/w/o: 31931.10/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 3 tps: 1111.79 qps: 32237.03 (r/w/o: 32237.03/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 3 tps: 1096.58 qps: 31800.94 (r/w/o: 31800.94/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            10277484
        write:                           0
        other:                           0
        total:                           10277484
    transactions:                        354396 (1181.30 per sec.)
    queries:                             10277484 (34257.65 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0039s
    total number of events:              354396

Latency (ms):
         min:                                    1.62
         avg:                                    2.54
         max:                                   14.96
         95th percentile:                        3.30
         sum:                               899590.39

Threads fairness:
    events (avg/stddev):           118132.0000/150.43
    execution time (avg/stddev):   299.8635/0.00